# Load oh-my-zsh for now...
robbyrussell/oh-my-zsh path:lib
robbyrussell/oh-my-zsh path:plugins/colored-man-pages
robbyrussell/oh-my-zsh path:plugins/common-aliases
robbyrussell/oh-my-zsh path:plugins/git
robbyrussell/oh-my-zsh path:plugins/git-extras
robbyrussell/oh-my-zsh path:plugins/mercurial
robbyrussell/oh-my-zsh path:plugins/shrink-path
robbyrussell/oh-my-zsh path:plugins/vi-mode
robbyrussell/oh-my-zsh path:plugins/virtualenvwrapper

felixr/docker-zsh-completion
zsh-users/zsh-completions path:src kind:fpath

# Local plugins
%LOCAL%/plugins

# These should be last
mafredri/zsh-async
zdharma/fast-syntax-highlighting

# THEME
# %LOCAL%/themes
romkatv/dotfiles-public path:.purepower
romkatv/powerlevel10k

