# Load oh-my-zsh for now...
robbyrussell/oh-my-zsh folder:lib
robbyrussell/oh-my-zsh folder:plugins/colored-man-pages
robbyrussell/oh-my-zsh folder:plugins/common-aliases
robbyrussell/oh-my-zsh folder:plugins/git
robbyrussell/oh-my-zsh folder:plugins/git-extras
robbyrussell/oh-my-zsh folder:plugins/mercurial
robbyrussell/oh-my-zsh folder:plugins/shrink-path
robbyrussell/oh-my-zsh folder:plugins/vi-mode
robbyrussell/oh-my-zsh folder:plugins/virtualenvwrapper

# Local plugins
%LOCAL%/plugins

# These should be last
mafredri/zsh-async
zdharma/fast-syntax-highlighting

# THEME
%LOCAL%/themes

