cask_args appdir: "/Applications"
tap "derailed/k9s"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "mongodb/brew"
tap "withgraphite/tap"
tap "wez/wezterm"
tap "koekeishiya/formulae"

brew "bat"
brew "bfg"
brew "brew-gem"
brew "btop"
brew "dust"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "graphite"
brew "httpie"
brew "jq"
brew "lab"
brew "lazydocker"
brew "lua"
brew "luarocks"
brew "mas"
brew "mdcat"
brew "mosh"
brew "neovim"
brew "pandoc"
brew "php"
brew "python"
brew "ripgrep"
brew "ruby"
brew "shfmt"
brew "slides"
brew "stow"
brew "stylua"
brew "tailscale"
brew "tmux"
brew "vale"
brew "watch"
brew "watchexec"
brew "wget"
brew "zoxide"
brew "zsh"

cask "1password"
cask "1password-cli"
cask "bartender"
cask "docker"
cask "font-iosevka"
cask "font-iosevka-term-nerd-font"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "gpg-suite"
cask "home-assistant"
cask "loopback"
cask "notion"
cask "obsidian"
cask "postman"
cask "raycast"
cask "slack"
cask "unite"
cask "visual-studio-code"
cask "wezterm"

mas "Spark Desktop", id: 6445813049

brew "aws-google-auth"
brew "aws-iam-authenticator"
brew "awscli"
brew "eksctl"
brew "localstack"
brew "mkcert"
brew "mongodb-database-tools"
brew "mongosh"
brew "n"

cask "figma"
cask "linear-linear"
cask "mongodb-compass"
cask "zoom"
