cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "homebrew/command-not-found"
tap "derailed/k9s"
tap "mongodb/brew"
tap "weaveworks/tap"
tap "fluxcd/tap"

brew "bat"
brew "brew-gem"
brew "codespell"
brew "dust"
brew "exa"
brew "fasd"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-extras"
brew "glab"
brew "go"
brew "hadolint"
brew "htop"
brew "httpie"
brew "jq"
brew "lua"
brew "luarocks"
brew "mas"
brew "mdcat"
brew "mosh"
brew "neovim", args: ["HEAD"]
brew "pandoc"
brew "php"
brew "python"
brew "ripgrep"
brew "ruby"
brew "shfmt"
brew "skaffold"
brew "stylua"
brew "tmux"
brew "watch"
brew "watchexec"
brew "wget"
brew "zsh"

cask "1password"
cask "1password-cli"
cask "alfred"
cask "brave-browser"
cask "docker"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "gpg-suite"
cask "kitty"
cask "loopback"
cask "notion"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zsa-wally"

mas "Spark", id: 1176895641
mas "Magnet", id: 441258766
mas "NordVPN IKE - Unlimited VPN", id: 1116599239
mas "Tailscale", id: 1475387142

brew "aws-elasticbeanstalk"
brew "aws-google-auth"
brew "aws-iam-authenticator"
brew "awscli"
brew "eksctl"
brew "fluxctl"
brew "flux"
brew "k3d"
brew "k9s"
brew "kubernetes-helm"
brew "mongodb-community-shell"
brew "mongodb-database-tools"
brew "mongosh"
cask "browserstacklocal"
cask "figma"
cask "mongodb-compass"
cask "tandem"
cask "zoom"
