cask_args appdir: "/Applications"
tap "derailed/k9s"
tap "fluxcd/tap"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "mongodb/brew"
tap "stripe/stripe-cli"
tap "weaveworks/tap"
tap "wez/wezterm"

brew "bat"
brew "brew-gem"
brew "btop"
brew "codespell"
brew "dust"
brew "exa"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-extras"
brew "glow"
brew "go"
brew "hadolint"
brew "httpie"
brew "jq"
brew "lab"
brew "lazydocker"
brew "lua"
brew "luarocks"
brew "mas"
brew "mdcat"
brew "mosh"
brew "neovim", args: ["HEAD"]
brew "pandoc"
brew "php"
brew "python"
brew "ripgrep"
brew "ruby"
brew "shfmt"
brew "skaffold"
brew "stylua"
brew "tailscale"
brew "tmux"
brew "watch"
brew "watchexec"
brew "wget"
brew "zoxide"
brew "zsh"

cask "1password"
cask "1password-cli"
cask "bartender"
cask "brave-browser"
cask "docker"
cask "font-iosevka"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "gpg-suite"
cask "loopback"
cask "notion"
cask "postman"
cask "raycast"
cask "slack"
cask "unite"
cask "visual-studio-code"
cask "wezterm"
cask "zsa-wally"

mas "Spark", id: 1176895641

brew "aws-google-auth"
brew "aws-iam-authenticator"
brew "awscli"
brew "eksctl"
brew "k3d"
brew "k9s"
brew "localstack"
brew "mongodb-database-tools"
brew "mongosh"
brew "n"
brew "shellcheck"
brew "stripe"

cask "browserstacklocal"
cask "figma"
cask "firefox"
cask "linear-linear"
cask "mongodb-compass"
cask "zoom"
